esp-cpp/espp/components/esp32-p4-wifi6-poe-eth/example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# for ESP-IDF >= v6.0, allow images that also run on pre-v3 ESP32-P4 chip
# revisions (matches the other Waveshare P4 boards; the fitted module revision
# has not been verified on hardware).
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# Ethernet (internal EMAC + RMII)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

CONFIG_FREERTOS_HZ=1000

# The board pairs the ESP32-P4NRW32 with a 32 MB GD25Q256E NOR flash (per the
# board schematic), so tell esptool the real size. The example keeps the
# default partition table, which fits comfortably regardless.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
